<div id="promo">
    <img src="images/promo2.jpg" class="contactIcon">
    <h1 id="promoText">
            Заглавное название Главной страницы
    </h1>
</div>

<div id="mainTextWrap">
    <div id="mainText">
        Здесь может быть описание компании, или какая либо информация по товару скидкам итп
        Здесь может быть описание компании, или какая либо информация по товару скидкам итп
        Здесь может быть описание компании, или какая либо информация по товару скидкам итп
        Здесь может быть описание компании, или какая либо информация по товару скидкам итп
    </div>
</div>